### Dados Ausentes

Vamos criar um DF com alguns dados ausentes.

In [58]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[np.nan,np.nan,np.nan],"D": [7,8,9]}
dd = pd.DataFrame(d)
dd

     A    B   C  D
0  1.0  5.0 NaN  7
1  2.0  NaN NaN  8
2  NaN  NaN NaN  9

o dropna() ele nos traz apenas as linhas sem valores ausentes. (podemos usar o axis=1 para trazer as colunas)

In [65]:
dd.dropna(axis=1)

   D
0  7
1  8
2  9

o metodo fillna() substitui os valos ausentes por algum outro valor.

In [66]:
dd.fillna("Fill na")

         A        B        C  D
0        1        5  Fill na  7
1        2  Fill na  Fill na  8
2  Fill na  Fill na  Fill na  9

Vamos substituir um valor ausente pela media dos outros valores da coluna.

In [68]:
dd["A"].fillna(dd["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

ou podemos substituir com o valor anterior passando como paramentro o (method="ffill")

In [70]:
dd.fillna(method="ffill")

     A    B   C  D
0  1.0  5.0 NaN  7
1  2.0  5.0 NaN  8
2  2.0  5.0 NaN  9

### Groupby

In [79]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [80]:
DF = pd.DataFrame(data)

In [81]:
DF

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Vamos agrupar pela empresa

In [86]:
group = DF.groupby("Empresa")

Ver o total vendido por empresa usamos o metodo sum() ou a media mean().

In [88]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [89]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

Para ter uma descrição geral do DF usamos o describe()

In [90]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0